hjjLeon/FDogs/H7Test.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=48000000
ProjectManager.MainLocation=Src
VP_TIM5_VS_ClockSourceINT.Mode=Internal
FREERTOS.Queues01=portRawDataRx,2048,uint8_t,0,Static,portRawDataRxBuffer,portRawDataRxControlBlock;cmdPacketRx,16,64,1,Static,cmdPacketRxBuffer,cmdPacketRxControlBlock;cmdPacketTx,16,64,1,Static,cmdPacketTxBuffer,cmdPacketTxControlBlock;portRawDataTx,2048,uint8_t,0,Static,portRawDataTxBuffer,portRawDataTxControlBlock;cmdPacketRxInstant,16,64,1,Static,cmdPacketRxInstantBuffer,cmdPacketRxInstantControlBlock
SH.S_TIM4_CH2.ConfNb=1
USB_DEVICE.CLASS_NAME_FS=CDC
VP_SYS_VS_tim6.Mode=TIM6
RCC.SAI1Freq_Value=480000000
RCC.CortexFreq_Value=480000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H750VBTx
RCC.HPRE=RCC_HCLK_DIV2
VP_TIM5_VS_ClockSourceINT.Signal=TIM5_VS_ClockSourceINT
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_TIM2_Init-TIM2-false-HAL-true,4-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-true,5-MX_CRC_Init-CRC-false-HAL-true
SH.S_TIM5_CH2.0=TIM5_CH2,PWM Generation2 CH2
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
USB_DEVICE.VirtualMode-CDC_FS=Cdc
RCC.CpuClockFreq_Value=480000000
RCC.VCO2OutputFreq_Value=96000000
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PC1.Locked=true
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x800
RCC.AHB4Freq_Value=240000000
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
RCC.VCOInput3Freq_Value=8000000
RCC.LPTIM1Freq_Value=120000000
PD13.Signal=S_TIM4_CH2
Mcu.IP4=NVIC
Mcu.IP5=RCC
Mcu.IP2=DEBUG
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=FREERTOS
Mcu.IP0=CORTEX_M7
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
Mcu.IP1=CRC
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
SH.S_TIM3_CH2.ConfNb=1
RCC.DIVP3Freq_Value=480000000
RCC.SDMMCFreq_Value=480000000
TIM2.Pulse-PWM\ Generation3\ CH3=1347
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=240000000
RCC.I2C4Freq_Value=120000000
Mcu.IPNb=13
TIM2.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3,Prescaler,Period,AutoReloadPreload,Pulse-PWM Generation1 CH1,Pulse-PWM Generation2 CH2,Pulse-PWM Generation3 CH3
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=480000000
SH.S_TIM5_CH3.0=TIM5_CH3,PWM Generation3 CH3
RCC.DIVQ3Freq_Value=48000000
Mcu.Pin6=PA0
Mcu.Pin7=PA1
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA2
Mcu.Pin9=PA3
FREERTOS.IPParameters=Tasks01,Queues01,FootprintOK,configUSE_IDLE_HOOK,Mutexes01
PC2_C.Signal=GPIO_Output
Mcu.Pin0=PC13
Mcu.Pin1=PH0-OSC_IN (PH0)
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.Pin2=PH1-OSC_OUT (PH1)
RCC.HRTIMFreq_Value=240000000
Mcu.Pin3=PC0
Mcu.Pin4=PC1
Mcu.Pin5=PC2_C
ProjectManager.ProjectBuild=false
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
RCC.DIVR3Freq_Value=480000000
RCC.HSE_VALUE=8000000
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.DIVM3=1
Mcu.IP10=TIM5
RCC.DIVM2=10
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
RCC.DIVM1=1
Mcu.IP12=USB_OTG_FS
Mcu.IP11=USB_DEVICE
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.5.0
MxDb.Version=DB.5.0.30
RCC.DIVP1Freq_Value=480000000
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=240000000
NVIC.TIM2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.USART16Freq_Value=120000000
File.Version=6
SH.S_TIM4_CH2.0=TIM4_CH2,PWM Generation2 CH2
SH.S_TIM2_CH1.ConfNb=1
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.S_TIM5_CH2.ConfNb=1
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
RCC.DIVR2Freq_Value=48000000
ProjectManager.HalAssertFull=true
RCC.DIVP2Freq_Value=48000000
PC2_C.Locked=true
ProjectManager.ProjectName=H7Test
PA0.Signal=S_TIM5_CH1
RCC.APB3Freq_Value=120000000
RCC.MCO2PinFreq_Value=480000000
Mcu.Package=LQFP100
TIM2.Prescaler=26
PA6.Signal=S_TIM3_CH1
NVIC.TimeBase=TIM6_DAC_IRQn
RCC.D1PPRE=RCC_APB3_DIV2
PD12.Signal=S_TIM4_CH1
NVIC.OTG_FS_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
ProjectManager.ToolChainLocation=
NVIC.TimeBaseIP=TIM6
FREERTOS.FootprintOK=true
USB_OTG_FS.VirtualMode=Device_Only
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.DFSDMFreq_Value=120000000
RCC.DIVR1Freq_Value=480000000
TIM2.Pulse-PWM\ Generation2\ CH2=1347
RCC.TraceFreq_Value=480000000
SH.S_TIM4_CH1.0=TIM4_CH1,PWM Generation1 CH1
RCC.APB4Freq_Value=120000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=480000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM5_CH1.0=TIM5_CH1,PWM Generation1 CH1
RCC.LPUART1Freq_Value=120000000
USB_OTG_FS.IPParameters=VirtualMode
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
RCC.Tim2OutputFreq_Value=240000000
RCC.DFSDMACLkFreq_Value=480000000
RCC.VCO3OutputFreq_Value=960000000
PA3.Signal=GPIO_Output
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
TIM4.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
SH.S_TIM4_CH1.ConfNb=1
ProjectManager.ProjectFileName=H7Test.ioc
RCC.DIVQ3=20
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
FREERTOS.Tasks01=commandTask,24,256,StartCommandTask,Default,NULL,Dynamic,NULL,NULL;AlgsTask,48,512,StartAlgsTask,Default,NULL,Dynamic,NULL,NULL;RawSendTask,40,512,StartRawSendTask,Default,NULL,Dynamic,NULL,NULL
TIM5.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
Mcu.PinsNb=31
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
PC13.Locked=true
PC13.Signal=GPIO_Input
RCC.SWPMI1Freq_Value=120000000
RCC.SAI4BFreq_Value=480000000
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
TIM5.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
ProjectManager.DeletePrevious=true
PC0.Signal=GPIO_Output
RCC.QSPIFreq_Value=240000000
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
CRC.IPParameters=DefaultPolynomialUse,CRCLength,DefaultInitValueUse
TIM2.Pulse-PWM\ Generation1\ CH1=1347
RCC.SPI6Freq_Value=120000000
RCC.D1CPREFreq_Value=480000000
FREERTOS.configUSE_IDLE_HOOK=1
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
CRC.DefaultPolynomialUse=DEFAULT_POLYNOMIAL_DISABLE
RCC.USART234578Freq_Value=120000000
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
RCC.SPI45Freq_Value=120000000
RCC.Tim1OutputFreq_Value=240000000
RCC.SPI123Freq_Value=480000000
PB3\ (JTDO/TRACESWO).Signal=S_TIM2_CH2
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=MDK-ARM V5
TIM4.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3
RCC.VCO1OutputFreq_Value=960000000
SH.S_TIM3_CH3.ConfNb=1
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
RCC.DIVN3=120
SH.S_TIM2_CH2.ConfNb=1
RCC.AXIClockFreq_Value=240000000
RCC.DIVN2=120
RCC.DIVN1=120
SH.S_TIM5_CH3.ConfNb=1
RCC.USBFreq_Value=48000000
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PA1.Signal=S_TIM5_CH2
RCC.CKPERFreq_Value=64000000
PB10.Signal=S_TIM2_CH3
SH.S_TIM4_CH3.ConfNb=1
RCC.USBCLockSelection=RCC_USBCLKSOURCE_PLL3
PA5.Signal=S_TIM2_CH1
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
board=custom
ProjectManager.LastFirmware=true
RCC.VCOInput1Freq_Value=8000000
TIM4.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
RCC.AHB12Freq_Value=240000000
RCC.APB2Freq_Value=120000000
MxCube.Version=5.3.0
VP_TIM2_VS_ClockSourceINT.Mode=Internal
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
RCC.FDCANFreq_Value=480000000
RCC.RNGFreq_Value=48000000
Mcu.Pin30=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.ADCFreq_Value=48000000
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TIM3.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM2_CH3.ConfNb=1
TIM2.Period=17777
ProjectManager.FreePins=true
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=false
Mcu.Name=STM32H750VBTx
RCC.LPTIM2Freq_Value=120000000
Mcu.Pin26=VP_TIM2_VS_ClockSourceINT
Mcu.Pin27=VP_TIM3_VS_ClockSourceINT
PA2.Signal=S_TIM5_CH3
Mcu.Pin24=VP_FREERTOS_VS_CMSIS_V2
ProjectManager.UnderRoot=false
Mcu.Pin25=VP_SYS_VS_tim6
Mcu.IP8=TIM3
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=TIM4
PD14.Signal=S_TIM4_CH3
Mcu.Pin28=VP_TIM4_VS_ClockSourceINT
Mcu.IP6=SYS
Mcu.Pin29=VP_TIM5_VS_ClockSourceINT
Mcu.IP7=TIM2
ProjectManager.CoupleFile=true
TIM5.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
RCC.SYSCLKFreq_VALUE=480000000
Mcu.Pin22=PB3 (JTDO/TRACESWO)
RCC.I2C123Freq_Value=120000000
Mcu.Pin23=VP_CRC_VS_CRC
Mcu.Pin20=PA13 (JTMS/SWDIO)
Mcu.Pin21=PA14 (JTCK/SWCLK)
PA3.Locked=true
PA12.Mode=Device_Only
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
CRC.DefaultInitValueUse=DEFAULT_INIT_VALUE_DISABLE
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_FS_DM
TIM5.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
ProjectManager.HeapSize=0x800
Mcu.Pin15=PD12
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PD13
Mcu.Pin13=PB0
Mcu.Pin14=PB10
Mcu.Pin19=PA12
SH.S_TIM3_CH1.ConfNb=1
RCC.LPTIM345Freq_Value=120000000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD14
Mcu.Pin18=PA11
VP_TIM4_VS_ClockSourceINT.Mode=Internal
FREERTOS.Mutexes01=portRawDataMutex,Dynamic,NULL
RCC.LTDCFreq_Value=480000000
RCC.SAI4AFreq_Value=480000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA6
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
Mcu.Pin12=PA7
Mcu.Pin10=PA5
RCC.DIVQ1Freq_Value=480000000
TIM2.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_DISABLE
RCC.D3PPRE=RCC_APB4_DIV2
RCC.HCLK3ClockFreq_Value=240000000
RCC.VCOInput2Freq_Value=800000
RCC.APB1Freq_Value=120000000
VP_CRC_VS_CRC.Mode=CRC_Activate
PB0.Signal=S_TIM3_CH3
PC0.Locked=true
ProjectManager.DeviceId=STM32H750VBTx
PC1.Signal=GPIO_Output
ProjectManager.LibraryCopy=0
SH.S_TIM5_CH1.ConfNb=1
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
CRC.CRCLength=CRC_POLYLENGTH_16B
PA7.Signal=S_TIM3_CH2
